_org_posts/_posts/2021-10-10-boj-9536.org
#+HTML: ---
#+HTML: title: BOJ 9536 여우는 어떻게 울지?
#+HTML: tags: STL
#+HTML: ---
#+OPTIONS: ^:nil

** BOJ 9536 여우는 어떻게 울지?

** 접근하기
- stdin의 처음부터 마지막까지 getline으로 입력받기
- 첫번재 줄 입력에서
  - 공백으로 구분된 string 전체를 받기
  - string을 token으로 분리하기
- 두번째 줄 입력에서 
- 3번째 단어만 vector에 저장

** 코드
#+BEGIN_SRC cpp
#include <sstream>
#include <iostream>
#include <cstdio>
#include <string>
#include <vector>
#include <algorithm>
using namespace std;

int T;

void solve()
{
    char split_char = ' ';
    string s;
    getline(cin >> ws, s);
   
    istringstream split(s);
    vector<string> tokens;
    for(string each; getline(split, each, split_char);tokens.push_back(each));

    string input;
    vector<string> arr;
    while(getline(cin >> ws, input)) {
        if (input == string("what does the fox say?")) break;

        istringstream split2(input);
        int i = 1;
        for(string each; getline(split2, each, split_char);i++) {
            if (i % 3 == 0) arr.push_back(each);
        }
    }
    for(auto& e:arr) {
        while(1) {
            auto it = find(tokens.begin(), tokens.end(), e);
            if (it != tokens.end()) {
                tokens.erase(it);
            } else {
                break;
            }
        }
    }

    for(auto& e:tokens) {
        cout << e.c_str() << " ";
    }
    cout << "\n";

}

int main(int argc, char* argv[])
{
    ios::sync_with_stdio(0);
    cin.tie(0);
    cin >> T;
    for(int tc=1;tc<=T;tc++) {
        solve();
    }
    return 0;
}
#+END_SRC

** 문제 링크
- https://www.acmicpc.net/problem/9536
